package com.example.calfood

data class Food(val id: Int, val name: String, val calories: Int)

data class DailyRecord(val date: String, val calories: Int)

data class UserProfile(
    val name: String = "",
    val weight: Float = 0f,
    val height: Float = 0f,
    val age: Int = 0,
    val gender: String = "ชาย"
)

val rawFoodData = listOf(
    "ข้าวกะเพราไก่ไข่ดาว" to 550,
    "ข้าวมันไก่" to 590,
    "ผัดไทยกุ้งสด" to 480,
    "ส้มตำไทย" to 120,
    "ก๋วยเตี๋ยวเรือ" to 180,
    "ข้าวขาหมู" to 690,
    "แกงเขียวหวานไก่" to 240,
    "สลัดผัก" to 100,
    "ชานมไข่มุก" to 360,
    "กาแฟดำ" to 10,
    "ข้าวผัดปู" to 540,
    "ต้มยำกุ้ง" to 150,
    "หมูปิ้ง (ไม้ละ)" to 120,
    "ข้าวเหนียว" to 160,
    "โจ๊กหมูใส่ไข่" to 250,
    "แกงจืดเต้าหู้หมูสับ" to 80,
    "ผัดซีอิ๊วหมู" to 520,
    "ข้าวมันไก่ทอด" to 650,
    "ลาบหมู" to 130,
    "ไก่ทอด (ชิ้นละ)" to 250,
    "น้ำตกหมู" to 165,
    "ยำวุ้นเส้น" to 120,
    "คะน้าหมูกรอบ" to 550,
    "ไข่เจียวหมูสับ" to 250,
    "ข้าวหมูแดง" to 540,
    "ราดหน้าหมู" to 400,
    "แกงส้มชะอมกุ้ง" to 220,
    "ไก่ย่าง (น่อง)" to 165,
    "ปูผัดผงกะหรี่" to 450,
    "หมูกระทะ (ชุด)" to 800,
    "สเต็กไก่" to 280,
    "แซนวิชแฮมชีส" to 290,
    "แฮมเบอร์เกอร์" to 450,
    "พิซซ่า (ชิ้น)" to 280,
    "โดนัท" to 250,
    "ไอศกรีม (ลูก)" to 150,
    "น้ำอัดลม" to 140,
    "เบียร์" to 150,
    "ไวน์" to 85,
    "ขนมปังโฮลวีต (แผ่น)" to 70
)
